tutorials/fluidSolidInteraction/microBeamInCrossFlow/system/fluid/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

matchTolerance 1e-3;

pointSync false;

patchInfo
(
    {
        name back;
        dictionary
        {
            type empty;
        }
        constructFrom patches;
        patches ("backPlane");
    }
    {
        name front;
        dictionary
        {
            type empty;
        }
        constructFrom patches;
        patches ("frontPlane");
    }
);

// ************************************************************************* //
