tutorials/fluidSolidInteraction/microBeamInCrossFlow/0/fluid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type         zeroGradient;
        //type       zeroGradientCorrected;
        value        uniform 0;
    }
    outlet
    {
        type        fixedValue;
        //type      fixedValueCorrected;
        value       uniform 0;
    }
    inlet
    {
        type         zeroGradient;
        //type         zeroGradientCorrected;
        value        uniform 0;
    }
    wall
    {
        type         zeroGradient;
        //type         zeroGradientCorrected;
        value        uniform 0;
    }
    frontPlane
    {
        type         empty;
    }
    backPlane
    {
        type         empty;
    }
}


// ************************************************************************* //
