tutorials/fluidSolidInteraction/microBeamInCrossFlow/system/functions.openfoam
functions
{
    pointDisp
    {
        type    solidPointDisplacement;
        point   (105e-6 50e-6 0);
    }
}
